stress.yaml
config:
  target: 'http://localhost:3004'
  phases:
    - duration: 1
      arrivalRate: 10
      name: "1 Request per second"
    - duration: 30
      arrivalRate: 10
      name: "10 Request per second"
    - duration: 30
      arrivalRate: 100
      name: "100 Request per second"
    - duration: 30
      arrivalRate: 10000
      name: "10000 Request per second"

scenarios:
  - name: "get database data and create new menu"
    flow:
      - get:
          url: "/menus/8272720"
      - post:
          url: "/addMenu/928829"
          json:
            menu: "Desserts"
            data: {
                    "itemName": "dofy",
                    "itemDescription": "nfw wjw",
                    "Price": "$20"
                  }


#  TRANSACTION DATA:

# Started phase 0 (100 Request per second), duration: 30s @ 19:34:13(-0700) 2019-04-27
# Report @ 19:34:23(-0700) 2019-04-27
# Elapsed time: 10 seconds
#   Scenarios launched:  99
#   Scenarios completed: 99
#   Requests completed:  198
#   RPS sent: 20.14
#   Request latency:
#     min: 1
#     max: 16.4
#     median: 2.6
#     p95: 4.3
#     p99: 7.1
#   Codes:
#     200: 99
#     201: 99

# Report @ 19:34:33(-0700) 2019-04-27
# Elapsed time: 20 seconds
#   Scenarios launched:  100
#   Scenarios completed: 100
#   Requests completed:  200
#   RPS sent: 20.04
#   Request latency:
#     min: 0.9
#     max: 7.6
#     median: 2.7
#     p95: 4.7
#     p99: 6.1
#   Codes:
#     200: 100
#     201: 100

# Report @ 19:34:43(-0700) 2019-04-27
# Elapsed time: 30 seconds
#   Scenarios launched:  100
#   Scenarios completed: 100
#   Requests completed:  200
#   RPS sent: 20.04
#   Request latency:
#     min: 0.9
#     max: 9.7
#     median: 2.4
#     p95: 3.4
#     p99: 7.8
#   Codes:
#     200: 100
#     201: 100

# Started phase 1 (100 Request per second), duration: 30s @ 19:34:43(-0700) 2019-04-27
# Report @ 19:34:53(-0700) 2019-04-27
# Elapsed time: 40 seconds
#   Scenarios launched:  999
#   Scenarios completed: 998
#   Requests completed:  1997
#   RPS sent: 200
#   Request latency:
#     min: 0.7
#     max: 40.4
#     median: 2
#     p95: 3.4
#     p99: 12
#   Codes:
#     200: 999
#     201: 998

# Warning:
# CPU usage of Artillery seems to be very high (pids: 3344)
# which may severely affect its performance.
# See https://artillery.io/docs/faq/#high-cpu-warnings for details.

# Report @ 19:35:03(-0700) 2019-04-27
# Elapsed time: 50 seconds
#   Scenarios launched:  1000
#   Scenarios completed: 1000
#   Requests completed:  2000
#   RPS sent: 200.4
#   Request latency:
#     min: 0.7
#     max: 41.1
#     median: 2
#     p95: 4.5
#     p99: 20
#   Codes:
#     200: 1000
#     201: 1000

# Report @ 19:35:13(-0700) 2019-04-27
# Elapsed time: 1 minute, 0 seconds
#   Scenarios launched:  1000
#   Scenarios completed: 1000
#   Requests completed:  2000
#   RPS sent: 200.2
#   Request latency:
#     min: 0.7
#     max: 33.3
#     median: 2
#     p95: 3.2
#     p99: 15.9
#   Codes:
#     200: 1000
#     201: 1000

# Started phase 2 (10000 Request per second), duration: 30s @ 19:35:13(-0700) 2019-04-27
# Warning: High CPU usage warning (pids: 3344).
# See https://artillery.io/docs/faq/#high-cpu-warnings for details.

# Report @ 19:35:23(-0700) 2019-04-27
# Elapsed time: 1 minute, 10 seconds
#   Scenarios launched:  2413
#   Scenarios completed: 2407
#   Requests completed:  4815
#   RPS sent: 481.42
#   Request latency:
#     min: 1.4
#     max: 82.7
#     median: 8.4
#     p95: 17.8
#     p99: 42.3
#   Codes:
#     200: 2408
#     201: 2407

# Warning: High CPU usage warning (pids: 3344).
# See https://artillery.io/docs/faq/#high-cpu-warnings for details.

# Report @ 19:35:33(-0700) 2019-04-27
# Elapsed time: 1 minute, 20 seconds
#   Scenarios launched:  2500
#   Scenarios completed: 2500
#   Requests completed:  5000
#   RPS sent: 501
#   Request latency:
#     min: 2
#     max: 175.2
#     median: 8.6
#     p95: 38.4
#     p99: 125.3
#   Codes:
#     200: 2500
#     201: 2500

# Warning: High CPU usage warning (pids: 3344).
# See https://artillery.io/docs/faq/#high-cpu-warnings for details.

# Report @ 19:35:43(-0700) 2019-04-27
# Elapsed time: 1 minute, 30 seconds
#   Scenarios launched:  2469
#   Scenarios completed: 2469
#   Requests completed:  4938
#   RPS sent: 494.79
#   Request latency:
#     min: 1
#     max: 155
#     median: 8.6
#     p95: 28.3
#     p99: 83.6
#   Codes:
#     200: 2469
#     201: 2469